"CARD_DETAILS_LABEL"                        = "Dados do cartão";
"ENTER_CARD_DETAILS_HELP_LABEL"             = "Introduza os dados do seu cartão começando pelo respetivo número.";
"VALID_CARD_ERROR_LABEL"                    = "Tem de indicar um número de cartão válido.";
"CARD_REQUIRED"                             = "O número do cartão é obrigatório.";
"CARD_INVALID"                              = "O número do cartão é inválido.";
"EXPIRATION_REQUIRED"                       = "A data de validade é obrigatória.";
"EXPIRATION_INVALID"                        = "A data de validade é inválida.";
"CVV_REQUIRED"                              = "O %s é obrigatório.";
"CVV_INVALID"                               = "O %s é inválido.";
"POSTAL_CODE_HELP_LABEL"                    = "Tem de indicar um código postal válido.";
"POSTAL_CODE_REQUIRED"                      = "O código postal é obrigatório.";
"POSTAL_CODE_INVALID"                       = "O código postal é inválido.";
"COUNTRY_CODE_REQUIRED"                     = "O código do país é obrigatório.";
"COUNTRY_CODE_INVALID"                      = "O código do país é inválido.";
"MOBILE_NUMBER_REQUIRED"                    = "O número de telemóvel é obrigatório.";
"MOBILE_NUMBER_INVALID"                     = "O número de telemóvel é inválido.";
"ENROLLMENT_WITH_SMS_HELP_LABEL"            = "O registo poderá ser obrigatório para este cartão. Será enviado um código SMS para este número, se necessário.";
"SMS_CODE_REQUIRED"                         = "O código SMS é obrigatório.";
"SMS_CODE_INVALID"                          = "O código SMS é inválido.";

"CANCEL_ACTION"                             = "Cancelar";
"RETRY_ACTION"                              = "Voltar a tentar";
"CONTINUE_ACTION"                           = "Continuar";
"ADD_CARD_ACTION"                           = "Adicionar";
"DONE_ACTION"                               = "Concluir";
"EDIT_ACTION"                               = "Editar";
"NEXT_ACTION"                               = "Seguinte";
"TOP_LEVEL_ERROR_ALERT_VIEW_OK_BUTTON_TEXT" = "OK";
"SCAN_CARD_IO_ACTION"                       = "Digitalizar com card.io";

"EDIT_PAYMENT_METHOD"                       = "Editar meios de pagamento";
"THERE_WAS_AN_ERROR"                        = "Lamentamos, mas ocorreu um erro.";
"REVIEW_AND_TRY_AGAIN"                      = "Reveja os seus dados e tente novamente.";
"INVALID_LABEL"                             = "Inválido:";

"YEAR_LABEL"                                = "Ano";
"MONTH_LABEL"                               = "Mês";

"OTHER_LABEL"                               = "Outro";
"CREDIT_OR_DEBIT_CARD_LABEL"                = "Cartão de crédito ou débito";
"RECENT_LABEL"                              = "Recente";
"SELECT_PAYMENT_LABEL"                      = "Selecionar meio de pagamento";

"CONFIRM_ENROLLMENT_LABEL"                  = "Confirmar registo";
"CONFIRM_ACTION"                            = "Confirmar";
"ENTER_SMS_CODE_SENT_HELP_LABEL"            = "Introduza o código SMS enviado para %s";
"SMS_CODE_LABEL"                            = "Código SMS";
"CARD_TYPE_GENERIC_CARD"                    = "Cartão";
"MOBILE_COUNTRY_CODE_LABEL"                 = "Código do país";
"SECURITY_CODE_LABEL"                       = "Código de segurança";
"CVV_FIELD_PLACEHOLDER"                     = "CVV";
"CVC_FIELD_PLACEHOLDER"                     = "CVC";
"CID_FIELD_PLACEHOLDER"                     = "CID";
"CVN_FIELD_PLACEHOLDER"                     = "CVN";
"POSTAL_CODE_PLACEHOLDER"                   = "Código postal";
"MOBILE_NUMBER_LABEL"                       = "Número de telemóvel";
"EXPIRATION_DATE_LABEL"                     = "Data de validade";
"CARD_NUMBER_PLACEHOLDER"                   = "Número do cartão";
"EXPIRY_PLACEHOLDER_FOUR_DIGIT_YEAR"        = "MM/AAAA";
"EXPIRY_PLACEHOLDER_TWO_DIGIT_YEAR"         = "MM/AA";

"PAYPAL"                                    = "PayPal";
"CARD_TYPE_AMERICAN_EXPRESS"                = "American Express";
"CARD_TYPE_DISCOVER"                        = "Discover";
"CARD_TYPE_DINERS_CLUB"                     = "Diners Club";
"CARD_TYPE_MASTER_CARD"                     = "MasterCard";
"CARD_TYPE_VISA"                            = "Visa";
"CARD_TYPE_JCB"                             = "JCB";
"CARD_TYPE_MAESTRO"                         = "Maestro";
"CARD_TYPE_UNION_PAY"                       = "UnionPay";
"BRANDING_COINBASE"                         = "Coinbase";
"BRANDING_VENMO"                            = "Venmo";
"BRANDING_APPLE_PAY"                        = "Apple Pay";
"BRANDING_ANDROID_PAY"                      = "Android Pay‏";
"USE_DIFFERENT_PHONE_NUMBER_ACTION"         = "Usar outro número de telefone";
"CARD_NOT_ACCEPTED_ERROR_LABEL"             = "Cartão não aceite.";

